Day 2/1 - Programming Solvers in OpenFOAM/Related Material/damBreakThermal/run/damBreakPermeableThermal/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (water air);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
    k               0.66;
    Cv              3900;
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
    k               0.03;
    Cv              718;
}

sigma           0.07;


// ************************************************************************* //
